/*
 * bmp280.h
 *
 *  Created on: Mar 18, 2024
 *      Author: de
 */

#ifndef _BMP280_H_INCLUDED_
#define _BMP280_H_INCLUDED_

#include <delay.h>
#include <i2cclient.h>
#include <spiclient.h>
#include <type_traits>
#include <limits>

// Error status of BMP280
// ***Query*** - sending a command to sensor
// ***Read*** - reading values from registers
// ***Write*** - writing to registers
enum class BMP280Error : uint8_t
{
	OK = 0,
	NotInitialized = 1, // check connection
	StartupTimeExceeded = 2,
	UnableToWriteResetCommand = 3,
	NotSupportedChipID = 4,
	InvalidChipID = 5,
	Busy = 6, // may be OK, try read the sensor later
	UnableToQueryReadyStatus = 7,
	UnableToReadReadyStatus = 8,
	UnableToReadCompensationCoefficients = 9,
	ImUpdating = 10, // may be OK, try read the sensor later
	Measuring = 11, // may be OK, try read the sensor later
	UnableToQueryCompensationCoefficients = 12,
	UnableToReadFilterRegistry = 13,
	UnableToUpdateFilterRegistry = 14,
	UnableToReadOversamplingRegistry = 15,
	UnableToUpdateOversamplingRegistry = 16,
	UnableToQueryChipID = 17,
	UnableToReadChipID = 18,
	UnableToQueryData = 19, // query for P, T error
	UnableToReadData = 20, // reading P, T error
};

// The 7-bit device address is 111011x. The 6 MSB bits are fixed. The last bit is changeable by SDO
// value and can be changed during operation. Connecting SDO to GND results in slave address
// 1110110 (0x76); connection it to VDDIO results in slave address 1110111 (0x77), which is the same
// as BMP180’s I2C address. The SDO pin cannot be left floating; if left floating, the I2C address will
// be undefined.
enum class BMP280I2CAddress : uint8_t
{
	// SDO->GND
	SDOToGND = 0b0111'0110 << 1, // The Right bit is R/W bit in I2C
	// SDO->VDDIO
	SDOToVDDIO = 0b0111'0111 << 1,
};

// In sleep mode, no measurements are performed. Normal mode comprises an automated
// perpetual cycling between an active measurement period and an inactive standby period. In
// forced mode, a single measurement is performed. When the measurement is finished, the sensor
// returns to sleep mode.
enum class BMP280PowerMode : uint8_t
{
	Sleep = 0b00,
	Normal = 0b11,
	Forced = 0b01,
	Forced2 = 0b10, // same as Forced, another value (see Table 10: mode settings, page 15)
};

// Pressure measurement can be enabled or skipped. Skipping the measurement could be useful if
// BMP280 is used as temperature sensor. When enabled, several oversampling options exist. Each
// oversampling step reduces noise and increases the output resolution by one bit, which is stored
// in the XLSB data register 0xF9. Enabling/disabling the measurement and oversampling settings
// are selected through the osrs_p[2:0] bits in control register 0xF4.
// see page 12
enum class BMP280PressureOversampling : uint8_t
{
	Skipped = 0, // output set to 0x80000
	UltraLowPower = 1,
	LowPower = 2,
	StandardResolution = 3,
	HighResolution = 4,
	UltraHighResolution = 5, // may be 5, 6, 7
};

// Temperature measurement can be enabled or skipped. Skipping the measurement could be
// useful to measure pressure extremely rapidly. When enabled, several oversampling options exist.
// Each oversampling step reduces noise and increases the output resolution by one bit, which is
// stored in the XLSB data register 0xFC. Enabling/disabling the temperature measurement and
// oversampling setting are selected through the osrs_t[2:0] bits in control register 0xF4.
enum class BMP280TemperatureOversampling : uint8_t
{
	Skipped = 0,
	UltraLowPower = 1,
	LowPower = 2,
	StandardResolution = 3,
	HighResolution = 4,
	UltraHighResolution = 5, // may be 5, 6, 7
};

// The environmental pressure is subject to many short-term changes, caused e.g. by slamming of
// a door or window, or wind blowing into the sensor. To suppress these disturbances in the output
// data without causing additional interface traffic and processor work load, the BMP280 features
// an internal IIR filter. It effectively reduces the bandwidth of the output signals.
// The IIR filter can be configured using the filter[2:0] bits in control register 0xF5
// See page 13.
enum class BMP280IIRFilterMode : uint8_t
{
	FilterOff = 0,
	Filter2 = 1,
	Filter4 = 2,
	Filter8 = 3,
	Filter16 = 4,
};

// For normal mode, see page 16
// time cycle = osrs_t + osrs_p + standby
// In t_standby we can read the data.
// The standby time is determined by the contents of the t_sb[2:0] bits in control register 0xF5
enum class BMP280StandbyTime : uint16_t
{
	Standby_0_5 = 0b000,  // 0.5 ms
	Standby_62_5 = 0b001, // 62.5 ms
	Standby_125 = 0b010,  // 125 ms
	Standby_250 = 0b011,  // 250 ms
	Standby_500 = 0b100,  // 500
	Standby_1000 = 0b101, // 1000
	Standby_2000 = 0b110, // 2000
	Standby_4000 = 0b111, // 4000
};

// For BMP280: Compensation parameter storage, naming and data type; LSB/MSB
// see page 21
struct BMP280CDATA
{
	uint16_t dig_T1; // 0x88 / 0x89, unsigned short
	int16_t dig_T2;  // 0x8A / 0x8B, signed short
	int16_t dig_T3; // 0x8C / 0x8D, signed short
	uint16_t dig_P1; // 0x8E / 0x8F, unsigned short
	int16_t dig_P2; // 0x90 / 0x91, signed short
	int16_t dig_P3; // 0x92 / 0x93, signed short
	int16_t dig_P4; // 0x94 / 0x95, signed short
	int16_t dig_P5; // 0x96 / 0x97, signed short
	int16_t dig_P6; // 0x98 / 0x99, signed short
	int16_t dig_P7; // 0x9A / 0x9B, signed short
	int16_t dig_P8; // 0x9C / 0x9D, signed short
	int16_t dig_P9; // 0x9E / 0x9F, signed short
	int16_t reserved; // 0xA0 / 0xA1, reserved
};

// For BME280
struct BME280CDATA : public BMP280CDATA
{
	uint8_t dig_H1; // 0xA1 unsigned char
	int16_t dig_H2; // 0xE1 / 0xE2 [7:0] / [15:8]signed short
	uint8_t dig_H3; // 0xE3 [7:0]unsigned char
	int16_t dig_H4; // 0xE4 / 0xE5[3:0] [11:4] / [3:0]signed short
	int16_t dig_H5; // 0xE5[7:4] / 0xE6 [3:0] / [11:4]signed short
	int8_t dig_H6;  // 0xE7 signed char
};

/**
 * BMP280
 * DIGITAL PRESSURE SENSOR
 */
template <class TInterfaceClient = I2CPollingClient,
		class CDATA = BMP280CDATA>
class BMP280Impl : public TInterfaceClient
{
protected:
	using BMP280_S32_t = int32_t;
	using BMP280_U32_t = uint32_t;
	using BMP280_S64_t = int64_t;
protected:
	CDATA cdata {};
	// All values are sets to 0 when reset (see 4.2 Memory map at page 24)
	mutable uint32_t _lastUpdateTime = 0;
	bool _initialized = false;
	bool _initStarted = false;
	mutable BMP280Error _error = BMP280Error::NotInitialized;
	BMP280IIRFilterMode _filterMode = BMP280IIRFilterMode::FilterOff;
	BMP280PowerMode _mode = BMP280PowerMode::Sleep;
	BMP280PressureOversampling _pressureOversampling = BMP280PressureOversampling::Skipped;
	BMP280TemperatureOversampling _temperatureOversampling = BMP280TemperatureOversampling::Skipped;
	BMP280StandbyTime _standbyTime = BMP280StandbyTime::Standby_0_5;
public:
	// Chip IDs
	enum : uint8_t {
